<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Blog</title>
    <link rel="stylesheet" href="css/main.css">
    <link rel="stylesheet" href="/css/font/flaticon.css">
    <link rel="preconnect" href="https://fonts.gstatic.com">
    <link href="https://fonts.googleapis.com/css2?family=Montserrat&family=Open+Sans&family=Roboto+Slab&display=swap" rel="stylesheet">
</head>
<body>
    <header>
        <section class="header-icons-conteiner">
            <div class="icons">
                <a href="/"><span class="fimanager flaticon-001-facebook"> </span></a>
                <a href="/"><span class="fimanager flaticon-002-twitter"> </span></a>
                <a href="/"><span class="fimanager flaticon-011-instagram"> </span></a>
                <a href="/"><span class="fimanager flaticon-008-youtube"> </span></a>
                <a href="/"><span class="fimanager flaticon-003-whatsapp"> </span></a>
            </div>
        </section>
        <nav>
            <section class="nav-logo-conteiner">
                <a href="/"> <img src="/assets/img/logo.png" alt=""></a>
            </section>
            <section class="profile-link">
                <a href="perfil.html">CONTACTO</a>
                <a href="/blogs.html">BLOGS</a>
            </section>
        </nav>
    </header>
    
    <main>
        <section class="blogpost-main-container">
            <div class="grid-container">
                <h3>Libertades del software libre</h3>
                <article>
<p>Es un sistema operativo de tipo <strong>Unix</strong>, lo cual significa que se trata de una colecci&oacute;n de muchos programas: aplicaciones, bibliotecas, herramientas de desarrollo, y hasta juegos. Estos tienden a ser de c&oacute;digo abierto (software libre), multiusuario y multitarea.</p>

<p>Dentro de la combinaci&oacute;n de estos proyectos, destaca el proyecto <strong>GNU </strong>encabezado por <strong>Richard Stallman </strong>junto a la <strong>Free software foundation. </strong>As&iacute; como tambi&eacute;n el n&uacute;cleo del sistema operativo conocido como <strong>Linux </strong>encabezado por <strong>Linus Torvalds. &nbsp;</strong></p>

<p>los sistemas operativos <strong>GNU/Linux, </strong>se encuentran normalmente en forma de distribuciones o distros, a las cuales se les ha a&ntilde;adido selecciones de aplicaciones y programas, con las que cuenta el sistema al ser instalado, as&iacute; como una serie de programas descargables desde repositorios.</p>

<p>El prop&oacute;sito de estas distribuciones es ofrecer <strong>GNU/Linux</strong> como un producto final que el usuario pueda instalar en sus computadoras para que funcione como su sistema operativo principal.</p>

<p>&nbsp;</p>


<p>El software libre significa que los usuarios tienen la libertad de ejecutar, copiar, distribuir, estudiar, modificar y mejorar el software.</p>

<p>Pero la palabra &ldquo;libre&rdquo; no significa &ldquo;gratis&rdquo;.</p>

<p>Para que un software se considere libre tiene que cumplir con 4 libertades:</p>

<p><strong>Libertad 0: </strong>libertad de ejecutar el programa como lo desee, con cualquier prop&oacute;sito.</p>

<p><strong>Libertad 1: </strong>libertad de estudiar el funcionamiento del programa y modificarlo de modo que realice las tareas como usted desee, esto requiere un acceso al c&oacute;digo fuente.</p>

<p><strong>Libertad 2: </strong>libertad de redistribuir copias para ayudar a los dem&aacute;s</p>

<p><strong>Libertad 3:</strong> libertad de distribuir copias de sus versiones modificadas para el beneficio de la comunidad.</p>

<p>Debido a la evoluci&oacute;n tecnol&oacute;gica, y el uso de las redes, estas libertades son mucho mas importantes que en 1983. Tambi&eacute;n podemos decir que el movimiento de software libre va mucho m&aacute;s all&aacute; del desarrollo del sistema GNU.</p>

<p>&nbsp;</p>

<p>&nbsp;</p>

<p>&nbsp;</p>

<p>El movimiento de software libre promueve una campa&ntilde;a para que los usuarios de ordenadores obtengan la libertad que otorga este. El software libre permite que los usuarios ejerzan el control de sus propias tareas de computaci&oacute;n. El software privativo somete a los usuarios al poder de los desarrolladores del software.</p>

<p>&nbsp;</p>

<p>&nbsp;</p>

<p><strong>Ventajas del sistema GNU/Linux</strong></p>

<ul>
	<li>Linux es muy robusto, estable y r&aacute;pido: ideal para servidores y aplicaciones distribuidas. A esto se a&ntilde;ade que puede funcionar en maquinas de bajos recursos (sencillas)</li>
	<li>Linux es libre: esto implica no solo la gratuidad del software, sino que tambi&eacute;n es modificable al gusto y conveniencia del usuario, tambi&eacute;n cuenta con una gran variedad de herramientas y aplicaciones en los repositorios, tambi&eacute;n cuenta con una extensa documentaci&oacute;n compartida.</li>
	<li>El mejor costo del mercado, gratuito o un precio simb&oacute;lico por el cd.</li>
	<li>Mayor estabilidad: por lo que es usado en servidores y computadoras de alto rendimiento.</li>
	<li>Las vulnerabilidades son detectadas y corregidas m&aacute;s r&aacute;pidamente que con cualquier otro sistema operativo.</li>
	<li>Seguridad a trav&eacute;s de la calidad y no oscuridad): todo software de calidad ha de poseer el c&oacute;digo fuente disponible. Es la &uacute;nica manera de garantizar la calidad de dicho software, puesto que miles de personas analizan este c&oacute;digo en busca de fallos lo que aumenta su seguridad.</li>
</ul>

                </article>
            </div>    
        </section>
        <section class="contact-main-container">
            <div>
                <img src="/assets/icons/correo (1).png" alt="">
                <div class="contact-left">
                    <a href="">Contacto</a>
                    <p>GLUD@UDISTRITAL.EDU.CO</p>
                </div>
            </div>
            <div>
                <img src="/assets/icons/favorito.png" alt="">
                <div class="contact-right">
                    <a href="">Escribe</a>
                    <p>Buscanos en nuestras redes sociales @GLUD.UD</p>
                </div>
            </div>
        </section>
    </main>

    <footer>
        
        <a rel="license" href="http://creativecommons.org/licenses/by/4.0/">
            <img alt="Licencia Creative Commons" style="border-width:0" src="https://i.creativecommons.org/l/by/4.0/88x31.png" /></a><br />Esta obra está bajo una <a rel="license" href="http://creativecommons.org/licenses/by/4.0/">Licencia Creative Commons Atribución 4.0 Internacional
        </a>
    </footer>
</body>
</html>